Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КошелькиПартии</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.Кошельки</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ПокупкиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыОбщие</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДолгов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПрямой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьРасхождениеДолговЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеткаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/КомпоновкаДанныхКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ДиаграммаВыбор(Форма, Элемент, ЗначениеДиаграммы, СтандартнаяОбработка) Экспорт 
	
	Если Форма.ТекУровеньГруппировки + 1 = Форма.МаксУровеньГруппировки Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Форма.ДиаграммаПеревернута Тогда 
		Если ТипЗнч(ЗначениеДиаграммы.Точка.Значение) = Тип("СправочникСсылка.Валюты") Тогда 
			Форма.ОтборДопВалюта.Добавить(ЗначениеДиаграммы.Точка.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Точка.Значение) = Тип("СправочникСсылка.Кошельки") Тогда 
			Форма.ОтборДопКошелек.Добавить(ЗначениеДиаграммы.Серия.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Точка.Значение) = Тип("СправочникСсылка.Метки") Тогда 
			Форма.ОтборДопМетка.Добавить(ЗначениеДиаграммы.Точка.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Точка.Значение) = Тип("СправочникСсылка.Статьи") Тогда 
			Форма.ОтборДопСтатья.Добавить(ЗначениеДиаграммы.Точка.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Точка.Значение) = Тип("ПеречислениеСсылка.ТипыОпераций") Тогда 
			Форма.ОтборДопТипОперации.Добавить(ЗначениеДиаграммы.Точка.Значение);
		КонецЕсли;
		
		Форма.МасОтборТекУровень.Добавить(ЗначениеДиаграммы.Точка.Значение);
	Иначе
		Если ТипЗнч(ЗначениеДиаграммы.Серия.Значение) = Тип("СправочникСсылка.Валюты") Тогда 
			Форма.ОтборДопВалюта.Добавить(ЗначениеДиаграммы.Серия.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Серия.Значение) = Тип("СправочникСсылка.Кошельки") Тогда 
			Форма.ОтборДопКошелек.Добавить(ЗначениеДиаграммы.Серия.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Серия.Значение) = Тип("СправочникСсылка.Метки") Тогда 
			Форма.ОтборДопМетка.Добавить(ЗначениеДиаграммы.Серия.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Серия.Значение) = Тип("СправочникСсылка.Статьи") Тогда 
			Форма.ОтборДопСтатья.Добавить(ЗначениеДиаграммы.Серия.Значение);
		ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Серия.Значение) = Тип("ПеречислениеСсылка.ТипыОпераций") Тогда 
			Форма.ОтборДопТипОперации.Добавить(ЗначениеДиаграммы.Серия.Значение);
		КонецЕсли;
		
		Форма.МасОтборТекУровень.Добавить(ЗначениеДиаграммы.Серия.Значение);
	КонецЕсли;
	
	Форма.ТекУровеньГруппировки = Форма.ТекУровеньГруппировки + 1;
	
	Форма.ОбновитьДиаграммуСервер();
	
КонецПроцедуры

Процедура ОбработкаРасшифровки(Форма, Элемент, Расшифровка, АдресДанныхРасшифровки, СтандартнаяОбработка, ДопПараметры = Неопределено) Экспорт 
	
	Парам = Новый Структура;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеРасшифровкиОтчета = ОтчетыСКД.ДанныеРасшифровкиОтчета(Расшифровка, АдресДанныхРасшифровки);
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровки.Свойство("Регистратор") Тогда 
		ПоказатьЗначение(, ДанныеРасшифровкиОтчета.ПоляРасшифровки.Регистратор);		
		
		Возврат;
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("Валюта") Тогда 
		Парам.Вставить("ОтборПоВалюте", ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Валюта);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ОтборВалюта") И Форма.ОтборВалюта.Количество() > 0 Тогда 
		Парам.Вставить("ОтборПоВалюте", Форма.ОтборВалюта.ВыгрузитьЗначения());		
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("Кошелек") Тогда 
		Парам.Вставить("ОтборПоКошельку", ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Кошелек);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ОтборКошелек") И Форма.ОтборКошелек.Количество() > 0 Тогда 
		Парам.Вставить("ОтборПоКошельку", Форма.ОтборКошелек.ВыгрузитьЗначения());		
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("Метка") Тогда 
		Парам.Вставить("ОтборПоМетке", ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Метка);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ОтборМетка") И Форма.ОтборМетка.Количество() > 0 Тогда 
		Парам.Вставить("ОтборПоМетке", Форма.ОтборМетка.ВыгрузитьЗначения());		
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("Статья") Тогда 
		Парам.Вставить("ОтборПоСтатье", ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Статья);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ОтборСтатья") И Форма.ОтборСтатья.Количество() > 0 Тогда 
		Парам.Вставить("ОтборПоСтатье", Форма.ОтборСтатья.ВыгрузитьЗначения());		
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("ТипОперации") Тогда 
		Парам.Вставить("ОтборПоТипуОперации", ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.ТипОперации);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ОтборТипОперации") И Форма.ОтборТипОперации.Количество() > 0 Тогда 
		Парам.Вставить("ОтборПоТипуОперации", Форма.ОтборТипОперации.ВыгрузитьЗначения());		
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("ФизЛицо") Тогда 
		Парам.Вставить("ОтборПоФизлицу", ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Физлицо);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ОтборФизлицо") И Форма.ОтборФизлицо.Количество() > 0 Тогда 
		Парам.Вставить("ОтборПоФизлицу", Форма.ОтборФизлицо.ВыгрузитьЗначения());		
	КонецЕсли;
	
	ПериодПарам = Новый Структура("НачалоПериода, КонецПериода", Дата(1,1,1), Дата(1,1,1));
	ТекПериодПарам = Новый Структура("НачалоПериода, КонецПериода", Дата(1,1,1), Дата(1,1,1));
	ИдентификаторПериода = "";
	
	Если ДанныеРасшифровкиОтчета.ПоляРасшифровки.Свойство("Сумма2") Тогда 
		ИдентификаторПериода = "2";
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПараметрыДанных.Свойство("Период" + ИдентификаторПериода) Тогда 
		ПериодПарам.Вставить("НачалоПериода", ДанныеРасшифровкиОтчета.ПараметрыДанных["Период" + ИдентификаторПериода].ДатаНачала);
		ПериодПарам.Вставить("КонецПериода", ДанныеРасшифровкиОтчета.ПараметрыДанных["Период" + ИдентификаторПериода].ДатаОкончания);
	КонецЕсли;
	
	Если ДанныеРасшифровкиОтчета.ПараметрыДанных.Свойство("Периодичность") И 
		ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("Период") И
		ДанныеРасшифровкиОтчета.ПараметрыДанных.Периодичность <> ПредопределенноеЗначение("Перечисление.Периодичность.Регистратор") Тогда 
		
		ТекПериодПарам = ОтчетыСКД.ПолучитьДанныеПериодаПоПериодичности(ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Период,
		ДанныеРасшифровкиОтчета.ПараметрыДанных.Периодичность);	
	ИначеЕсли ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.Свойство("ПериодМесяц") Тогда 
		ТекПериодПарам = ОтчетыСКД.ПолучитьДанныеПериодаПоПериодичности(ДанныеРасшифровкиОтчета.ПоляРасшифровкиРодители.ПериодМесяц, "Месяц");
	КонецЕсли;
	
	ПериодПарамИтог = Новый Структура;
	ПериодПарамИтог.Вставить("НачалоПериода", Макс(ПериодПарам.НачалоПериода, ТекПериодПарам.НачалоПериода));
	ПериодПарамИтог.Вставить("КонецПериода", Мин(ПериодПарам.КонецПериода, ТекПериодПарам.КонецПериода));
	
	Если ЗначениеЗаполнено(ПериодПарамИтог.НачалоПериода) Или ЗначениеЗаполнено(ПериодПарамИтог.КонецПериода) Тогда 
		Парам.Вставить("ОтборПоПериоду", ПериодПарамИтог);
	КонецЕсли;
	
	Если ДопПараметры <> Неопределено Тогда 
		Если ДопПараметры.Свойство("ОтборПоТипуОперации") Тогда 
			Парам.Вставить("ОтборПоТипуОперации", ДопПараметры.ОтборПоТипуОперации);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Документ.Операция.ФормаСписка", Парам, Форма);
	
КонецПроцедуры

#КонецОбласти
